using System;
// 선언된 네임스페이스 내부 개체들에 접근

/* -----------------------------
 * Name : _001_HelloWorld
 * DESC : 코드 리뷰
 --------------------------------*/
namespace _HelloWorld
/*-------------------------------
 * 그룹화
 * 동일한 함수 이름 사용 가능
 --------------------------------*/
{
    class MainClass
        /*----------------------------------------
         * 필드(field)(변수), 메소드(method)(함수)로 분리
         * 프로그램을 구성하는 기본
         -----------------------------------------*/
    {
        public static void Main(string[] args)
        
        {
            Console.WriteLine("Hello World!");
        }
    }
}

